export const data2 = [
    {
        id: 1,
        title: "Состав пряников",
        text: "В состав входят: мука пшеничная в/с, масло сливочное 82,5%, сахар, яичный желток, корица, имбирь, мускатный орех, гвоздика, кардамон, белый перец, соль, сода, глазурь белковая (айсинг), краситель пищевой. По желанию какие либо специи можно убрать из состава"
    },
    {
        id: 2,
        title: "Длительность приготовления пряников",
        text: "Стандартное время изготовления пряников 3 дня. В первый день создаётся форма пряника, замешивается тесто. Тесто должно отстояться как минимум 12 часов в прохладном месте. Во второй день происходит выпечка и базовая заливка глазурью. После заливки, пряники должны подсохнуть, это необходимо для дальнейшего придания пряничному рисунку своей сочности и четкости. В третий день происходит окончательное нанесение рисунка на пряники."
    },
    {
        id: 3,
        title: "Свежесть пряников",
        text: "Пряники не пекутся заранее. Всё изготавливается по индивидуальным заказам."
    },
    {
        id: 4,
        title: "Срок хранения пряников",
        text: "Пряники хранятся около 3 месяцев при комнатной температуре в плотно закрытом пакете или контейнере. В холодильнике хранить пряники нельзя, так как глазурь не любит холод и влагу."
    },
    {
        id: 5,
        title: "Форма и мотив пряников",
        text: "Форма и мотив пряников может быть абсолютно различной. Здесь на страничке представлены только некоторые мои изделия. Мы заранее обсудим какой формы пряники вы бы хотели получить и только после этого я приступлю к изготовлению вашего заказа."
    },
    {
        id: 6,
        title: "Информация при заказе",
        text: "В контактном формуляре необходимо указать: желаемую форму, размер, количество пряников /наборов, дату получения заказа, вид доставки: самовывоз или курьерская доставка "
    },
]